Revit 2027 API
FilledRegionType.ForegroundPatternColor Property
 The foreground fill pattern color.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color ForegroundPatternColor { get; set; }
Public Property ForegroundPatternColor As Color
	Get
	Set
public:
property Color^ ForegroundPatternColor {
	Color^ get ();
	void set (Color^ value);
}
member ForegroundPatternColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
FilledRegionType Class
Autodesk.Revit.DB Namespace